app/views/slots/index.html.erb

SELECT "slots".* FROM "slots"
---

      <%= select_tag :features, options_for_select(Slot.features.collect {|k,v| [k.humanize, k]}), include_blank: "Search by features"%>