app/controllers/reservations_controller.rb

  def index
    @reservations = current_user.reservations # .where(status: "reserved")
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = $1 AND "reservations"."status" = $2  [["user_id", 1], ["status", 0]]

  def check_out
    if @reservation.update(check_out: Time.now)
---
UPDATE "reservations" SET "status" = $1, "updated_at" = $2 WHERE "reservations"."id" = $3  [["status", 1], ["updated_at", "2023-06-18 20:43:24.466598"], ["id", 8]]

  def update
    if @reservation.update(reservation_params)
---
UPDATE "reservations" SET "vehicle_number" = $1, "updated_at" = $2 WHERE "reservations"."id" = $3  [["vehicle_number", "dsdsafurqan"], ["updated_at", "2023-06-18 20:32:06.940902"], ["id", 8]]

  def set_reservation
    @reservation = Reservation.find_by(id: params[:id])
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]