app/models/reservation.rb

  def reservation_charges
    if check_in.present?
      # As customer will checkout/leave
      slot_price = Slot.find_by(id: slot_id).price
      self.charges = number_of_hours * slot_price
    elsif status == 'cancelled'
      # if reservation will be canceled in that case customer have to pay half chrages of actual slot on the base of hours
      make_unavailable_reservation
      slot_price = Slot.find_by(id: slot_id).price / 2
---
SELECT "slots".* FROM "slots" WHERE "slots"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def make_unavailable_reservation
    Slot.find_by(id: slot_id).update(is_available: false)
---
UPDATE "slots" SET "is_available" = $1, "updated_at" = $2 WHERE "slots"."id" = $3  [["is_available", false], ["updated_at", "2023-06-18 19:34:27.465620"], ["id", 4]]
SELECT "slots".* FROM "slots" WHERE "slots"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]